Repository: LittleGD/UpNext
Catalog: upnext-ios/UpNext/UpNext/RetentionSetup.xcstrings
Source language: ko
Languages: en, ja, zh_hans

source: 내일도 이어가요
en: Keep it going tomorrow
ja: 明日も続けよう
zh_hans: 明天继续

source: 눈에 보이면 더 쉬워요
en: Keep it in sight
ja: 目に入ると、続けやすい
zh_hans: 看得见，更容易坚持

source: 닫기
en: Close
ja: 閉じる
zh_hans: 关闭

source: 내일 만날 시간, 정했어요
en: See you tomorrow
ja: 明日の時間が決まりました
zh_hans: 明天见面的时间定好了

source: 홈 화면에 자리 잡았어요
en: Your widget is in place
ja: ホーム画面に追加できました
zh_hans: 小组件已添加到主屏幕

source: 알림을 다시 켜볼까요?
en: Turn reminders back on
ja: 通知をもう一度オンに
zh_hans: 重新开启提醒

source: 첫 실천 완료! 내일은 언제 만날까요?
en: First challenge complete! When works for tomorrow?
ja: 初めてのチャレンジ達成！ 明日は何時にしましょう？
zh_hans: 第一次挑战完成！ 明天几点提醒你？

source: 두 번째 실천도 완료! 홈 화면에 꺼내둘까요?
en: Two challenges complete! Keep the next one in sight.
ja: 2つ目のチャレンジも達成！ ホーム画面に置きませんか？
zh_hans: 第二次挑战也完成了！ 把挑战放到主屏幕吧

source: 위젯을 놓을 자리를 만들어요
en: Make room for your widget
ja: ウィジェットを置く 場所を作りましょう
zh_hans: 为小组件 腾出位置

source: UpNext를 찾아 위젯을 골라요
en: Find UpNext. Choose your widget.
ja: UpNextを探して ウィジェットを選びます
zh_hans: 找到 UpNext 选择小组件

source: 이제 홈 화면에서 직접 추가해보세요
en: Now add it to your Home Screen
ja: 次はホーム画面で 追加してみましょう
zh_hans: 现在到主屏幕 实际添加吧

source: 선택한 시간에 하루 한 번 알려드릴게요. 설정에서 언제든 바꿀 수 있어요.
en: You’ll get one reminder a day at your chosen time. Change it anytime in Settings.
ja: 選んだ時間に1日1回お知らせします。設定でいつでも変更できます。
zh_hans: 每天会在你选择的时间提醒一次。随时可以在设置中更改。

source: 오늘의 챌린지를 바로 확인하고, 위젯을 눌러 UpNext로 돌아올 수 있어요.
en: See today’s challenge at a glance. Tap the widget to return to UpNext.
ja: 今日のチャレンジをひと目で確認。タップするとUpNextに戻れます。
zh_hans: 一眼查看今天的挑战。轻点小组件即可返回 UpNext。

source: 실천하기 편한 시간을 골라주세요. 하루 한 번, 오늘의 챌린지를 알려드릴게요.
en: Pick a time that fits your day. We’ll remind you of your challenge once a day.
ja: 取り組みやすい時間を選んでください。今日のチャレンジを1日1回お知らせします。
zh_hans: 选择方便行动的时间。每天提醒你一次今天的挑战。

source: 앱을 열지 않아도 오늘 할 일이 보여요. 아래 화면으로 추가하는 방법을 연습해봐요.
en: See your challenge without opening the app. Try adding a widget in the practice screen below.
ja: アプリを開かなくても今日やることが見えます。下の画面で追加の手順を練習しましょう。
zh_hans: 不用打开应用也能看到今天的任务。在下方练习如何添加小组件。

source: 홈 화면을 길게 누른 다음, 왼쪽 위 ‘편집’에서 ‘위젯 추가’를 선택해요.
en: Touch and hold the Home Screen. Tap Edit at the top left, then Add Widget.
ja: ホーム画面を長押しし、左上の「編集」から「ウィジェットを追加」を選びます。
zh_hans: 长按主屏幕，轻点左上角“编辑”，再选择“添加小组件”。

source: 위젯 목록에서 UpNext를 검색하고, 원하는 크기를 고른 뒤 ‘위젯 추가’를 눌러요.
en: Search for UpNext in the widget gallery. Choose a size, then tap Add Widget.
ja: ウィジェットの一覧でUpNextを検索し、サイズを選んで「ウィジェットを追加」をタップします。
zh_hans: 在小组件列表中搜索 UpNext，选择尺寸，然后轻点“添加小组件”。

source: 홈 화면으로 나가 아래 순서대로 추가해주세요. 돌아오면 설치 여부를 확인할게요.
en: Go to your Home Screen and follow these steps. We’ll check for your widget when you return.
ja: ホーム画面に戻り、次の手順で追加してください。戻ってきたら追加できたか確認します。
zh_hans: 返回主屏幕，按以下步骤添加。你回来后，我们会检查是否已添加。

source: 알림 설정 완료
en: Reminder set
ja: 通知設定が完了
zh_hans: 提醒已设置

source: 알림 미리보기
en: Notification preview
ja: 通知のプレビュー
zh_hans: 通知预览

source: 아침
en: Morning
ja: 朝
zh_hans: 早上

source: 점심
en: Midday
ja: 昼
zh_hans: 中午

source: 저녁
en: Evening
ja: 夜
zh_hans: 晚上

source: 직접 고르기
en: Choose a time
ja: 時間を選ぶ
zh_hans: 自选时间

source: 알림 시간
en: Reminder time
ja: 通知の時間
zh_hans: 提醒时间

source: 위젯 추가를 확인했어요
en: Widget detected
ja: ウィジェットを確認しました
zh_hans: 已检测到小组件

source: 연습 화면 · %lld/3
en: Practice · %lld/3
ja: 練習画面 · %lld/3
zh_hans: 练习 · %lld/3

source: 홈 화면의 빈 곳을 길게 누르기
en: Touch and hold an empty area of the Home Screen
ja: ホーム画面の何もない場所を長押し
zh_hans: 长按主屏幕的空白区域

source: 편집 → 위젯 추가
en: Edit → Add Widget
ja: 編集 → ウィジェットを追加
zh_hans: 编辑 → 添加小组件

source: UpNext 검색 → 위젯 추가 → 완료
en: Search UpNext → Add Widget → Done
ja: UpNextを検索 → ウィジェットを追加 → 完了
zh_hans: 搜索 UpNext → 添加小组件 → 完成

source: 홈 버튼이 있는 기기는 홈 버튼을 누르고, 다른 기기는 화면 아래에서 위로 쓸어올려 홈 화면으로 이동해요.
en: Press the Home button, or swipe up from the bottom of the screen on devices without one.
ja: ホームボタンを押すか、ホームボタンのない端末では画面の下から上にスワイプします。
zh_hans: 有主屏幕按钮的设备请按主屏幕按钮，其他设备请从屏幕底部向上轻扫。

source: iOS 17에서는 ‘편집’ 대신 왼쪽 위 + 버튼을 눌러요.
en: On iOS 17, tap + at the top left instead of Edit.
ja: iOS 17では「編集」の代わりに左上の＋をタップします。
zh_hans: 在 iOS 17 中，请轻点左上角的 + 按钮，而不是“编辑”。

source: 확인 중
en: Checking
ja: 確認中
zh_hans: 正在检查

source: 좋아요
en: Done
ja: 完了
zh_hans: 完成

source: 기기 알림 설정 열기
en: Open notification settings
ja: 端末の通知設定を開く
zh_hans: 打开通知设置

source: 이 시간에 알림 받기
en: Remind me at this time
ja: この時間に通知を受け取る
zh_hans: 在这个时间提醒我

source: 설정을 열지 못했어요. 기기 설정에서 UpNext의 알림을 켜주세요.
en: Couldn’t open Settings. Enable notifications for UpNext in your device Settings.
ja: 設定を開けませんでした。端末の設定からUpNextの通知をオンにしてください。
zh_hans: 无法打开设置。请在设备设置中开启 UpNext 的通知。

source: 추가했어요 · 확인하기
en: I added it · Check now
ja: 追加しました · 確認する
zh_hans: 已添加 · 检查

source: 방법 다시 보기
en: Show me again
ja: 手順をもう一度見る
zh_hans: 再看一遍

source: 연습 마치고 직접 추가하기
en: Finish practice and add it
ja: 練習を終えて追加する
zh_hans: 结束练习，实际添加

source: 다음 단계
en: Next step
ja: 次の手順
zh_hans: 下一步

source: 나중에 할게요
en: Maybe later
ja: あとで
zh_hans: 稍后再说

source: 설정을 저장하지 못했어요. 다시 시도해주세요.
en: Couldn’t save your reminder. Please try again.
ja: 設定を保存できませんでした。もう一度お試しください。
zh_hans: 无法保存提醒，请重试。

source: 아직 위젯이 확인되지 않아요. 홈 화면에서 추가한 뒤 다시 확인해주세요.
en: No widget detected yet. Add it to your Home Screen, then check again.
ja: まだウィジェットが見つかりません。ホーム画面に追加してから、もう一度確認してください。
zh_hans: 暂未检测到小组件。请先添加到主屏幕，再检查一次。

source: 위젯을 확인하지 못했어요. 잠시 후 다시 확인해주세요.
en: Couldn’t check for your widget. Please try again shortly.
ja: ウィジェットを確認できませんでした。少し待ってから再度お試しください。
zh_hans: 无法检查小组件，请稍后重试。

source: 여기서 연습해보세요
en: Try it here
ja: ここで練習しましょう
zh_hans: 在这里练习

source: 편집
en: Edit
ja: 編集
zh_hans: 编辑

source: 완료
en: Done
ja: 完了
zh_hans: 完成

source: 위젯 추가
en: Add Widget
ja: ウィジェットを追加
zh_hans: 添加小组件

source: 빈 곳을 길게 눌러보세요
en: Touch and hold the empty space
ja: 何もない場所を長押し
zh_hans: 长按空白处

source: 빈 곳을 길게 누르기 연습
en: Practice touching and holding an empty area
ja: 何もない場所を長押しする練習
zh_hans: 练习长按空白区域

source: 연습 완료
en: Practice complete
ja: 練習できました
zh_hans: 练习完成

source: 위젯 크기
en: Widget size
ja: ウィジェットのサイズ
zh_hans: 小组件尺寸

source: 작게
en: Small
ja: 小さく
zh_hans: 小

source: 넓게
en: Wide
ja: 横長
zh_hans: 宽

source: 위젯 추가 연습
en: Practice adding a widget
ja: ウィジェット追加の練習
zh_hans: 练习添加小组件

source: 이제 같은 방법으로 실제 홈 화면에 추가해봐요.
en: Now follow the same steps on your real Home Screen.
ja: 次は同じ手順で実際のホーム画面に追加しましょう。
zh_hans: 现在用同样的方法添加到真正的主屏幕吧。

source: 오늘의 챌린지
en: Today’s challenge
ja: 今日のチャレンジ
zh_hans: 今天的挑战

source: 알림 설정 가이드
en: Reminder setup guide
ja: 通知設定ガイド
zh_hans: 提醒设置指南

source: 홈 화면 위젯 가이드
en: Home Screen widget guide
ja: ホーム画面ウィジェットガイド
zh_hans: 主屏幕小组件指南

source: 나에게 맞는 알림 시간을 정해요
en: Find a time that works for you
ja: 自分に合う 通知の時間を選びましょう
zh_hans: 选择适合自己的 提醒时间

source: 오늘의 챌린지를 홈 화면에서 만나요
en: Your daily challenge, on your Home Screen
ja: 今日のチャレンジを ホーム画面に
zh_hans: 在主屏幕上 查看今天的挑战

source: 기기 설정에서 ‘알림’을 열고 ‘알림 허용’을 켠 뒤 돌아오세요. 선택한 시간으로 마무리할게요.
en: In Settings, open Notifications and turn on Allow Notifications. Come back to finish with your chosen time.
ja: 設定で「通知」を開き、「通知を許可」をオンにしてから戻ってください。選んだ時間で設定を仕上げます。
zh_hans: 在系统设置中打开“通知”，开启“允许通知”后返回。我们会按你选择的时间完成设置。
